{"input_text": "A 3-month-old male baby is crying because of burping. Please provide brief action recommendations to help new parents. Make it in one paragraph, quick treatment", "output_text": "Immediately try to burp the baby by gently patting his back while he's held upright over your shoulder or sitting on your lap. Ensure he releases any trapped air after feeding to prevent discomfort and crying."}
{"input_text": "A 1-month-old female baby is crying because of hungry. Please provide brief action recommendations to help new parents. Make it in one paragraph, quick treatment", "output_text": "Offer breast or bottle immediately. Look for feeding cues like rooting or hand-to-mouth movements. Ensure she has a proper latch or bottle position to get enough milk until satisfied."}
{"input_text": "A 6-month-old male baby is crying because of discomfort. Please provide brief action recommendations to help new parents. Make it in one paragraph, quick treatment", "output_text": "Check for obvious sources of discomfort like a dirty diaper, tangled clothing, or if he's too hot or cold. Look for rashes or anything irritating his skin and address it promptly, changing his position if needed."}
{"input_text": "A 2-month-old female baby is crying because of belly pain. Please provide brief action recommendations to help new parents. Make it in one paragraph, quick treatment", "output_text": "Gently massage her tummy in a clockwise motion or bicycle her legs towards her chest to help release gas. A warm bath or a warm compress on the tummy can also provide quick relief. If severe, consult a pediatrician."}
{"input_text": "A 4-month-old male baby is crying because of tired. Please provide brief action recommendations to help new parents. Make it in one paragraph, quick treatment", "output_text": "Recognize his tired cues like yawning or eye-rubbing and immediately move him to a quiet, dim environment. Begin a calming bedtime or nap routine, such as rocking or a lullaby, to help him settle down quickly for sleep."}
{"input_text": "A 5-month-old female baby is crying because of burping. Please provide brief action recommendations to help new parents. Make it in one paragraph, quick treatment", "output_text": "Keep her upright for 20-30 minutes after feeding and encourage burping frequently throughout and after the meal. A gentle pat or rub on the back can assist in bringing up trapped air quickly."}
{"input_text": "A 2-month-old male baby is crying because of hungry. Please provide brief action recommendations to help new parents. Make it in one paragraph, quick treatment", "output_text": "Even if he fed recently, offer a small top-up feed as babies often feed on demand. Sometimes they just need comfort feeding. Monitor his feeding schedule and adjust if he seems to be consistently hungry earlier than expected."}
{"input_text": "A 7-month-old female baby is crying because of discomfort. Please provide brief action recommendations to help new parents. Make it in one paragraph, quick treatment", "output_text": "Examine her for anything causing physical irritation, such as a hair tourniquet on a toe, a teething pain, or clothing tags. Change her diaper promptly and ensure she's dressed comfortably for the environment."}
{"input_text": "A 1-month-old male baby is crying because of belly pain. Please provide brief action recommendations to help new new parents. Make it in one paragraph, quick treatment", "output_text": "Swaddle the baby tightly and gently rock him. Apply a warm compress to his abdomen and try infant gas drops after consulting with your pediatrician. Constant crying warrants a doctor's visit."}
{"input_text": "A 3-month-old female baby is crying because of tired. Please provide brief action recommendations to help new parents. Make it in one paragraph, quick treatment", "output_text": "Establish a consistent, calming pre-sleep routine like a warm bath, gentle massage, or quiet story time. Create a dark, quiet, and cool sleeping environment to signal it's time for rest, helping her fall asleep faster."}
{"input_text": "A 4-month-old male baby is crying because of burping. Please provide brief action recommendations to help new parents. Make it in one paragraph, quick treatment", "output_text": "Hold him in an upright position and gently pat his back until he burps. If he seems to swallow a lot of air during feeds, consider adjusting his feeding position or bottle nipple flow rate."}
{"input_text": "A 6-month-old female baby is crying because of hungry. Please provide brief action recommendations to help new parents. Make it in one paragraph, quick treatment", "output_text": "Check her last feeding time; if it's been a while, offer a feed (breast, bottle, or age-appropriate solids). Sometimes a growth spurt means they need more frequent feeding, so pay attention to her hunger cues."}
{"input_text": "A 5-month-old male baby is crying because of discomfort. Please provide brief action recommendations to help new parents. Make it in one paragraph, quick treatment", "output_text": "Check his temperature and clothing to ensure he's not too hot or cold. Reposition him, maybe try a different carrying hold, or offer a soothing toy if he's teething, as these can cause discomfort."}
{"input_text": "A 1-month-old female baby is crying because of belly pain. Please provide brief action recommendations to help new parents. Make it in one paragraph, quick treatment", "output_text": "Perform gentle tummy massages or try bicycle kicks with her legs to help pass gas. If formula-fed, ensure the formula is mixed correctly and the bottle nipple flow isn't too fast, which can cause excess air intake."}
{"input_text": "A 7-month-old male baby is crying because of tired. Please provide brief action recommendations to help new parents. Make it in one paragraph, quick treatment", "output_text": "Recognize his tiredness cues quickly and stick to his sleep schedule. Create a calm, dark, and quiet room and use a consistent naptime or bedtime routine to help him transition to sleep easily and minimize overtired crying."}
{"input_text": "A 8-month-old male baby is crying because of discomfort. Please provide brief action recommendations to help new parents. Make it in one paragraph, quick treatment", "output_text": "Inspect his body for any signs of rash, bug bites, or hair tourniquets, especially around fingers and toes. Ensure his clothes are not restrictive and he's not sitting in a wet diaper. Offer a change of scenery or a comforting toy if teething."}
{"input_text": "A 9-month-old female baby is crying because of hungry. Please provide brief action recommendations to help new parents. Make it in one paragraph, quick treatment", "output_text": "Offer a breastfeed, bottle, or a healthy, age-appropriate snack immediately. As she's older, she might be going through a growth spurt or just genuinely hungry between meals. Ensure her solid food intake is sufficient for her activity level."}
{"input_text": "A 10-month-old male baby is crying because of belly pain. Please provide brief action recommendations to help new parents. Make it in one paragraph, quick treatment", "output_text": "Offer small sips of water if he's old enough. Try gentle belly massage or a warm bath. If he's already eating solids, review recent foods for anything new that might cause indigestion. Persistent pain should be checked by a doctor."}
{"input_text": "A 11-month-old female baby is crying because of tired. Please provide brief action recommendations to help new parents. Make it in one paragraph, quick treatment", "output_text": "Stick to her consistent nap and bedtime routine. Ensure her sleep environment is conducive to rest—dark, quiet, and cool. Offer a quick cuddle or comfort item to help her settle down and drift off to sleep without prolonged crying."}
{"input_text": "A 12-month-old male baby is crying because of discomfort. Please provide brief action recommendations to help new parents. Make it in one paragraph, quick treatment", "output_text": "Check for any physical discomfort like a loose thread on clothes, a small injury, or a painful tooth coming in. Offer pain relief suitable for his age if teething, and ensure his environment is safe from small objects or sharp edges."}